practice-for-ch-react-pokedex-rails-backend-long-practice-main/pokedex-rails-backend/app/controllers/api/pokemon_controller.rb

SELECT "pokemons"."poke_type" FROM "pokemons" GROUP BY "pokemons"."poke_type"
---
    def types
        @types = Pokemon.all.select("poke_type").group("poke_type")
        @types_arr = @types.map do |type|